// accordionData.ts

import type { PanelProps } from '$lib/components/Accordion/PanelProps';

export const accordionData: PanelProps[] = [
  {
    header: 'Μισθοδοσία & Ωρομέτρηση',
    details: [
      'Η μισθοδοσία και η ωρομέτρηση αν και άρρηκτα συνδεδεμένα, είναι δυο έννοιες διαφορετικές.',
      'Η εφαρμογή της ωρομέτρησης:',
      '-Ελέγχει και παρακολουθεί τις παρουσίες του προσωπικού',
      '-Επεξεργάζεται τα χτυπήματα των εργαζομένων με ανάλυση των ωρών εργασίας τους',
      '-Διαχειρίζεται τις άδειές τους',
      '-Προγραμματίζει τις βάρδιες όπου είναι αναγκαίο και',
      '-Εξάγει τα αποτελέσματα που χρειάζεται η εφαρμογή της μισθοδοσίας.',
    ],
  },
  {
    header: 'Υπέρβαση ωραρίου',
    details: [
      'Πρόωρη προσέλευση ή καθυστέρηση αποχώρησης. Το ΕΡΓΑΝΗ πρέπει να πάρει τα χτυπήματα με ακρίβεια λεπτού και δεν προβλέπεται από το υπουργείο εργασίας ελαστικότητα στο χτύπημα. ',
      'Σε περιπτώσεις επιχειρήσεων με μεγάλο αριθμό εργαζομένων αυτό δεν είναι εφικτό, ακόμα και με περισσότερα από ένα τερματικά. Για να αντιμετωπίσουμε αυτό το πρόβλημα, το λογισμικό στρογγυλοποιεί τα χτυπήματα εισόδου στο προδηλωμένο ωράριο εργασίας παρέχοντας ένα εύλογο χρονικό περιθώριο σύμφωνα με τον νόμο.',
    ],
  },
  {
    header: 'Δεδομένα βάσει της νομοθεσίας',
    details: [
      '15 λεπτά περιθώριο – δήλωση προσέλευσης/αποχώρησης-',
      'Η δήλωση προσέλευσης/αποχώρησης εργαζομένου μπορεί να υποβληθεί με μέγιστο χρόνο καθυστέρησης τα 15 λεπτά. Σε αντίθετη περίπτωση πρέπει να αιτιολογηθεί η εκπρόθεσμη δήλωση με μια από τις δοθείσες επιλογές (Πρόβλημα στα Συστήματα του Εργοδότη ή Πρόβλημα στην Ηλεκτροδότηση/Τηλεπικοινωνίες ή Πρόβλημα σύνδεσης με το Π.Σ ΕΡΓΑΝΗ)',
      '<strong><u>ΠΡΟΣΟΧΗ:</strong></u> Η επαναλαμβανόμενη καθυστέρηση υποβολής δηλώσεων έναρξης & λήξης στο ΕΡΓΑΝΗ, συνιστά αιτία ελέγχου από το ΣΕΠΕ.',
    ],
  },
  {
    header: 'Έλεγχος συμβατότητας δηλωθέντος ωραρίου',
    details: ['Το χτύπημα εισόδου θα στρογγυλοποιείται στο δηλωθέν ωράριο εργασίας.'],
  },
  {
    header: 'Εργαζόμενοι που ξέχασαν να χτυπήσουν την κάρτα τους',
    details: [
      '<strong>Εργαζόμενοι που ξέχασαν να χτυπήσουν την κάρτα τους</strong> ενώ βρίσκονται στη επιχείρηση ή ξέχασαν να την χτυπήσουν με το πέρας  της εργασίας τους.',
      'Στις περίπτωσεις αυτές είτε θα ειδοποιηθεί ο εργαζόμενος και θα χτυπήσει την κάρτα του είτε θα δηλώσει ο υπεύθυνος χειροκίνητα την είσοδό του ή την έξοδό του.',
      '<strong><u>Σημείωση:</strong></u> Επειδή -σύμφωνα με την νομοθεσία- ΥΠΕΥΘΥΝΟΣ για το  χτύπημα της κάρτας του εργαζόμενου είναι ο ΕΡΓΟΔΟΤΗΣ, το λογισμικό θα σας ενημερώσει έγκαιρα ώστε ενέργειες αυτού του τύπου να μην επιφέρουν κυρώσεις και  πρόστιμα στην επιχείρηση αλλά και να μην αποτελέσουν  πιθανό αίτιο ελέγχου από το ΣΕΠΕ.',
    ],
  },
  {
    header: 'Έλεγχος εργαζομένων σε Άδεια, Ρεπό, Μη εργασία ή Ευέλικτη προσέλευση',
    details: [
      '<strong>Ενημέρωση της επιχείρησης για αποφυγή σφαλμάτων</strong>',
      '<i>Για παράδειγμα, σε περιπτώσεις όπου οι επιλογές Σε άδεια, Ρεπό, Μη Εργασία δεν μπορούν να συνδυάζονται με δηλώσεις εργασίας ή τηλεργασίας ή σε περιπτώσεις  υπέρβασης ή επικάλυψης της δοθείσας άδειας, το λογισμικό θα εμφανίσει <u>απαγορευτική κόκκινη ένδειξη</u> στην καρτέλα του εργαζόμενου.</i>',
      '<strong><u>Σημείωση:</strong></u> Επειδή -σύμφωνα με την νομοθεσία- ΥΠΕΥΘΥΝΟΣ για το  χτύπημα της κάρτας του εργαζόμενου είναι ο ΕΡΓΟΔΟΤΗΣ, το λογισμικό θα σας ενημερώσει έγκαιρα ώστε ενέργειες αυτού του τύπου να μην επιφέρουν κυρώσεις και  πρόστιμα στην επιχείρηση αλλά και να μην αποτελέσουν  πιθανό αίτιο ελέγχου από το ΣΕΠΕ.',
    ],
  },
  {
    header: 'Απαγόρευση 2πλών χτυπημάτων προσέλευσης ή αποχώρησης',
    details: ['Το λογισμικό δέχεται ως έγκυρο μόνο το πρώτο χτύπημα (είτε εισόδου, είτε εξόδου)'],
  },
  {
    header: 'Τήρηση νόμιμου χρόνου ανάπαυσης μεταξύ βαρδιών ή υπέρβασης 40ωρου',
    details: [
      'Σε περίπτωση υπέρβασης θα εμφανίζεται κόκκινη προειδοποιητική ένδειξη  στο λογισμικό και θα αποστέλλεται ενημέρωση με <u>viber</u> σε έναν ή περισσότερους αριθμούς που θα ορίσει η επιχείρηση, ώστε να επιληφθούν του θέματος.',
    ],
  },
];
